cmsis-svd/cmsis-svd/data/SiliconLabs/EFM32G2xx.svd
        <register>
          <name>IFS</name>
          <description>Interrupt Flag Set Register</description>
          <addressOffset>0x1004</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x800000FF</resetMask>
          <fields>
            <field>
              <name>CH0DONE</name>
              <description>DMA Channel 0 Complete Interrupt Flag Set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH1DONE</name>
              <description>DMA Channel 1 Complete Interrupt Flag Set</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2DONE</name>
              <description>DMA Channel 2 Complete Interrupt Flag Set</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH3DONE</name>
              <description>DMA Channel 3 Complete Interrupt Flag Set</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH4DONE</name>
              <description>DMA Channel 4 Complete Interrupt Flag Set</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH5DONE</name>
              <description>DMA Channel 5 Complete Interrupt Flag Set</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH6DONE</name>
              <description>DMA Channel 6 Complete Interrupt Flag Set</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH7DONE</name>
              <description>DMA Channel 7 Complete Interrupt Flag Set</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ERR</name>
              <description>DMA Error Interrupt Flag Set</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IFC</name>
          <description>Interrupt Flag Clear Register</description>
          <addressOffset>0x1008</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x800000FF</resetMask>
          <fields>
            <field>
              <name>CH0DONE</name>
              <description>DMA Channel 0 Complete Interrupt Flag Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH1DONE</name>
              <description>DMA Channel 1 Complete Interrupt Flag Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2DONE</name>
              <description>DMA Channel 2 Complete Interrupt Flag Clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH3DONE</name>
              <description>DMA Channel 3 Complete Interrupt Flag Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH4DONE</name>
              <description>DMA Channel 4 Complete Interrupt Flag Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH5DONE</name>
              <description>DMA Channel 5 Complete Interrupt Flag Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH6DONE</name>
              <description>DMA Channel 6 Complete Interrupt Flag Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH7DONE</name>
              <description>DMA Channel 7 Complete Interrupt Flag Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ERR</name>
              <description>DMA Error Interrupt Flag Clear</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IEN</name>
          <description>Interrupt Enable register</description>
          <addressOffset>0x100C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x800000FF</resetMask>
          <fields>
            <field>
              <name>CH0DONE</name>
              <description>DMA Channel 0 Complete Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1DONE</name>
              <description>DMA Channel 1 Complete Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2DONE</name>
              <description>DMA Channel 2 Complete Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3DONE</name>
              <description>DMA Channel 3 Complete Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4DONE</name>
              <description>DMA Channel 4 Complete Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH5DONE</name>
              <description>DMA Channel 5 Complete Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH6DONE</name>
              <description>DMA Channel 6 Complete Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH7DONE</name>
              <description>DMA Channel 7 Complete Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERR</name>
              <description>DMA Error Interrupt Flag Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH0_CTRL</name>
          <description>Channel Control Register</description>
          <addressOffset>0x1100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x003F000F</resetMask>
          <fields>
            <field>
              <name>SIGSEL</name>
              <description>Signal Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOURCESEL</name>
              <description>Source Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No source selected</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>Analog to Digital Converter 0</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC0</name>
                  <description>Digital to Analog Converter 0</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART0</name>
                  <description>Universal Synchronous/Asynchronous Receiver/Transmitter 0</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART1</name>
                  <description>Universal Synchronous/Asynchronous Receiver/Transmitter 1</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART2</name>
                  <description>Universal Synchronous/Asynchronous Receiver/Transmitter 2</description>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEUART0</name>
                  <description>Low Energy UART 0</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEUART1</name>
                  <description>Low Energy UART 1</description>
                  <value>0x00000011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0</name>
                  <description>I2C 0</description>
                  <value>0x00000014</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER0</name>
                  <description>Timer 0</description>
                  <value>0x00000018</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER1</name>
                  <description>Timer 1</description>
                  <value>0x00000019</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER2</name>
                  <description>Timer 2</description>
                  <value>0x0000001A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0</name>
                  <description>Universal Asynchronous Receiver/Transmitter 0</description>
                  <value>0x0000002C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSC</name>
                  <value>0x00000030</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES</name>
                  <description>Advanced Encryption Standard Accelerator</description>
                  <value>0x00000031</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CH1_CTRL</name>
          <description>Channel Control Register</description>
          <addressOffset>0x1104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x003F000F</resetMask>
          <fields>
            <field>
              <name>SIGSEL</name>
              <description>Signal Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOURCESEL</name>
              <description>Source Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No source selected</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>Analog to Digital Converter 0</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC0</name>
                  <description>Digital to Analog Converter 0</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART0</name>
                  <description>Universal Synchronous/Asynchronous Receiver/Transmitter 0</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART1</name>
                  <description>Universal Synchronous/Asynchronous Receiver/Transmitter 1</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART2</name>
                  <description>Universal Synchronous/Asynchronous Receiver/Transmitter 2</description>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEUART0</name>
                  <description>Low Energy UART 0</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEUART1</name>
                  <description>Low Energy UART 1</description>
                  <value>0x00000011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0</name>
                  <description>I2C 0</description>
                  <value>0x00000014</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER0</name>
                  <description>Timer 0</description>
                  <value>0x00000018</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER1</name>
                  <description>Timer 1</description>
                  <value>0x00000019</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER2</name>
                  <description>Timer 2</description>
                  <value>0x0000001A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0</name>
                  <description>Universal Asynchronous Receiver/Transmitter 0</description>
                  <value>0x0000002C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSC</name>
                  <value>0x00000030</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES</name>
                  <description>Advanced Encryption Standard Accelerator</description>
                  <value>0x00000031</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_CTRL</name>
          <description>Channel Control Register</description>
          <addressOffset>0x1108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x003F000F</resetMask>
          <fields>
            <field>
              <name>SIGSEL</name>
              <description>Signal Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOURCESEL</name>
              <description>Source Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No source selected</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>Analog to Digital Converter 0</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC0</name>
                  <description>Digital to Analog Converter 0</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART0</name>
                  <description>Universal Synchronous/Asynchronous Receiver/Transmitter 0</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART1</name>
                  <description>Universal Synchronous/Asynchronous Receiver/Transmitter 1</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART2</name>
                  <description>Universal Synchronous/Asynchronous Receiver/Transmitter 2</description>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEUART0</name>
                  <description>Low Energy UART 0</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEUART1</name>
                  <description>Low Energy UART 1</description>
                  <value>0x00000011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0</name>
                  <description>I2C 0</description>
                  <value>0x00000014</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER0</name>
                  <description>Timer 0</description>
                  <value>0x00000018</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER1</name>
                  <description>Timer 1</description>
                  <value>0x00000019</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER2</name>
                  <description>Timer 2</description>
                  <value>0x0000001A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0</name>
                  <description>Universal Asynchronous Receiver/Transmitter 0</description>
                  <value>0x0000002C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSC</name>
                  <value>0x00000030</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES</name>
                  <description>Advanced Encryption Standard Accelerator</description>
                  <value>0x00000031</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
